## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.my-cap-billing-function will be created
+   resource "google_cloudfunctions_function" "my-cap-billing-function" {
+       available_memory_mb           = 128
+       description                   = "Function to unlink project from billing account"
+       docker_registry               = (known after apply)
+       entry_point                   = "stop_billing"
+       environment_variables         = {
+           "MY_BUDGET_ALERT_ID" = "billingAccounts/015525-9D090C-CC8778/budgets/202bd776-ad03-4278-b5f2-b05cad2f3bff"
        }
+       https_trigger_security_level  = (known after apply)
+       https_trigger_url             = (known after apply)
+       id                            = (known after apply)
+       ingress_settings              = "ALLOW_ALL"
+       labels                        = {
+           "terraform" = "true"
        }
+       max_instances                 = 1
+       min_instances                 = 0
+       name                          = "cap-billing-4d24222494a1db4c"
+       project                       = "terrateam-362405"
+       region                        = "us-central1"
+       runtime                       = "python39"
+       service_account_email         = "sa-cap-billing@terrateam-362405.iam.gserviceaccount.com"
+       source_archive_bucket         = "5e3160b1-934a-ddc5-22e5-e6d8ff326b41"
+       source_archive_object         = "function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip"
+       timeout                       = 120
+       vpc_connector_egress_settings = (known after apply)

+       event_trigger {
+           event_type = "google.pubsub.topic.publish"
+           resource   = "cap-billing-alert"

+           failure_policy {
+               retry = false
            }
        }
    }

  # google_storage_bucket_object.my-cap-billing-archive must be replaced
-/+ resource "google_storage_bucket_object" "my-cap-billing-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "yoMu1g==" -> (known after apply)
!       detect_md5hash   = "Qr4Y0ZVn0fYWP1EPYQLEqw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "5e3160b1-934a-ddc5-22e5-e6d8ff326b41-function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "Qr4Y0ZVn0fYWP1EPYQLEqw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/5e3160b1-934a-ddc5-22e5-e6d8ff326b41/o/function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip?generation=1663200968895422&alt=media" -> (known after apply)
-       metadata         = {} -> null
        name             = "function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip"
!       output_name      = "function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/5e3160b1-934a-ddc5-22e5-e6d8ff326b41/o/function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
